app/Controllers/Admin.php

    public function index()
    {
        $user       = new UsersModel();
        $article    = new ArticlesModel();
        $visitor    = new VisitorsModel();
        $data = [
            'user'  => $user->join('community', 'community.id_community = users.id_community')->find(session()->get('id_users')),
            'visitor_lab' => $visitor->where('DAY(created_at)', date('d'))->where('type', 1)->countAllResults(),
            'visitor_web' => $visitor->where('DAY(created_at)', date('d'))->where('type', 2)->countAllResults(),
            'article' => $article->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `visitors`
WHERE DAY(created_at) = '22'
AND `type` = 1
SELECT COUNT(*) AS `numrows`
FROM `visitors`
WHERE DAY(created_at) = '22'
AND `type` = 2
SELECT COUNT(*) AS `numrows`
FROM `articles`

    public function notifItem()
    {
        $article       = new ArticlesModel();
        $data = [
            'data' => $article->where('notification', 1)->findAll(),
        ];
---
SELECT *
FROM `articles`
WHERE `notification` = 1

    public function notifCount()
    {
        $article       = new ArticlesModel();
        $data = $article->where('notification', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `articles`
WHERE `notification` = 1

    public function notifStatusChange()
    {
        if ($this->request->getPost('status')) {
            $article = new ArticlesModel();
            $article->set('notification', 2)->where('notification', 1)->update();
---
UPDATE `articles` SET `notification` = 2
WHERE `notification` = 1

        function bulan($a) {
            $visitor = new VisitorsModel();
            $bulan = $visitor->where('MONTH(created_at)', $a)->where('YEAR(created_at)', date('Y'))->where('type', 2)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `visitors`
WHERE MONTH(created_at) = 1
AND YEAR(created_at) = '2023'
AND `type` = 2