app/Controllers/Article.php

SELECT *
FROM `articles`
JOIN `categories` ON `categories`.`id_categories` = `articles`.`id_categories`
WHERE `status` = 1
ORDER BY `date` DESC
 LIMIT 4
---
    public function index()
    {
        $article = new ArticlesModel();
        $user = new UsersModel();
        $category = new CategoriesModel();
        $community = new CommunityModel();

        $roles = session()->get('roles');
        if ($roles == 'admin' ) {
            $data = [
                'user'  => $user->find(session()->get('id_users')),
                'categories' => $category->findAll(),
                'community' => $community->findAll(),
                'articles' => $article->join('categories', 'categories.id_categories = articles.id_categories')->where('status', 1)->orderBy('date', 'desc'),
                'articles' => $article->paginate(4, 'articles'),