app/Controllers/Article.php

SELECT *
FROM `categories`
SELECT *
FROM `community`
SELECT *
FROM `articles`
JOIN `categories` ON `categories`.`id_categories` = `articles`.`id_categories`
WHERE `status` = 1
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `articles`
JOIN `categories` ON `categories`.`id_categories` = `articles`.`id_categories`
WHERE `status` = 1
SELECT *
FROM `articles`
JOIN `categories` ON `categories`.`id_categories` = `articles`.`id_categories`
WHERE `status` = 1
AND `id_users` = '27'
ORDER BY `date` DESC
 LIMIT 4
SELECT *
FROM `users`
WHERE `users`.`id_users` = '27'
SELECT COUNT(*) AS `numrows`
FROM `articles`
JOIN `categories` ON `categories`.`id_categories` = `articles`.`id_categories`
WHERE `status` = 1
AND `id_users` = '27'
---
    public function index()
    {
        $article = new ArticlesModel();
        $user = new UsersModel();
        $category = new CategoriesModel();
        $community = new CommunityModel();

        $roles = session()->get('roles');
        if ($roles == 'admin' ) {
            $data = [
                'user'  => $user->find(session()->get('id_users')),
                'categories' => $category->findAll(),
                'community' => $community->findAll(),
                'articles' => $article->join('categories', 'categories.id_categories = articles.id_categories')->where('status', 1),
                'articles' => $article->paginate(4, 'articles'),
                'pager' => $article->pager
            ];
            echo view('admin/article', $data);
        } else {
            $data = [
                'user'  => $user->find(session()->get('id_users')),
                'categories' => $category->findAll(),
                'articles' => $article->join('categories', 'categories.id_categories = articles.id_categories')->where(['status' => 1, 'id_users' => session()->get('id_users')]),
                'articles' => $article->paginate(4, 'articles'),

INSERT INTO `articles` (`slug`, `title`, `description`, `thumbnail`, `date`, `id_users`, `id_categories`, `status`) VALUES ('dgfgdg', 'dgfgdg', '<p>sdsfdfsdf</p>', '1674311142_f60d7460a7901102231f.jpg', '2023-01-21', '15', '9', 2)
---
    public function save()
    {
        $thumbnail = $this->request->getFile('thumbnail');
        if ($thumbnail->getError() == 4) {
            $thumbnailName = 'dafault.jpg';
        } else {
            $thumbnailName = $thumbnail->getRandomName();
            $thumbnail->move('img', $thumbnailName);
        }

        $roles = session()->get('roles');

        $slug = url_title($this->request->getPost('title'), '-', true);
        $article  = new ArticlesModel();
        $article->save([
            'slug' => $slug,
            'title' => $this->request->getPost('title'),
            'description' => $this->request->getPost('description'),
            'thumbnail' => $thumbnailName,
            'date' => date("Y-m-d"),
            'id_users' => session()->get('id_users'),
            'id_categories' => $this->request->getPost('id_categories'),
            'status' => $roles == 'admin' ? 1 : 2,
        ]);

SELECT *
FROM `categories`
SELECT *
FROM `articles`
JOIN `categories` ON `categories`.`id_categories` = `articles`.`id_categories`
WHERE `status` = 2
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `articles`
JOIN `categories` ON `categories`.`id_categories` = `articles`.`id_categories`
WHERE `status` = 2
---
    public function verificationView()
    {
        $article = new ArticlesModel();
        $category = new CategoriesModel();
        $data = [
            'categories' => $category->findAll(),
            'articles' => $article->join('categories', 'categories.id_categories = articles.id_categories')->where('status', 2),
            'articles' => $article->paginate(4, 'articles'),