app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'bem'
 LIMIT 1
---
    public function auth()
    {
        $session  = session();
        $model    = new UsersModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $data = $model->where('username', $username)->first();