app/Controllers/Setting.php

    public function index()
    {
        $user = new UsersModel();
        $data = [
            // 'user'  => $user->find(session()->get('id_users')),
            'user'  => $user->join('community', 'community.id_community = users.id_community')->find(session()->get('id_users')),
---
SELECT *
FROM `users`
JOIN `community` ON `community`.`id_community` = `users`.`id_community`
WHERE `users`.`id_users` = '15'